apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_can.h
/************************************************************************************
 * arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_can.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC17_40_CHIP_CAN_H
#define __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC17_40_CHIP_CAN_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "hardware/lpc17_40_memorymap.h"

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/* Register offsets *****************************************************************/
/* CAN acceptance filter registers */

#define LPC17_40_CANAF_AFMR_OFFSET      0x0000 /* Acceptance Filter Register */
#define LPC17_40_CANAF_SFFSA_OFFSET     0x0004 /* Standard Frame Individual Start Address Register */
#define LPC17_40_CANAF_SFFGRPSA_OFFSET  0x0008 /* Standard Frame Group Start Address Register */
#define LPC17_40_CANAF_EFFSA_OFFSET     0x000c /* Extended Frame Start Address Register */
#define LPC17_40_CANAF_EFFGRPSA_OFFSET  0x0010 /* Extended Frame Group Start Address Register */
#define LPC17_40_CANAF_EOT_OFFSET       0x0014 /* End of AF Tables register */
#define LPC17_40_CANAF_LUTERRAD_OFFSET  0x0018 /* LUT Error Address register */
#define LPC17_40_CANAF_LUTERR_OFFSET    0x001c /* LUT Error Register */
#define LPC17_40_CANAF_FCANIE_OFFSET    0x0020 /* FullCAN interrupt enable register */
#define LPC17_40_CANAF_FCANIC0_OFFSET   0x0024 /* FullCAN interrupt and capture register 0 */
#define LPC17_40_CANAF_FCANIC1_OFFSET   0x0028 /* FullCAN interrupt and capture register 1 */

/* Central CAN registers */

#define LPC17_40_CAN_TXSR_OFFSET        0x0000 /* CAN Central Transmit Status Register */
#define LPC17_40_CAN_RXSR_OFFSET        0x0004 /* CAN Central Receive Status Register */
#define LPC17_40_CAN_MSR_OFFSET         0x0008 /* CAN Central Miscellaneous Register */

/* CAN1/2 registers */

#define LPC17_40_CAN_MOD_OFFSET         0x0000 /* CAN operating mode */
#define LPC17_40_CAN_CMR_OFFSET         0x0004 /* Command bits */
#define LPC17_40_CAN_GSR_OFFSET         0x0008 /* Controller Status and Error Counters */
#define LPC17_40_CAN_ICR_OFFSET         0x000c /* Interrupt and capure register */
#define LPC17_40_CAN_IER_OFFSET         0x0010 /* Interrupt Enable */
#define LPC17_40_CAN_BTR_OFFSET         0x0014 /* Bus Timing */
#define LPC17_40_CAN_EWL_OFFSET         0x0018 /* Error Warning Limit */
#define LPC17_40_CAN_SR_OFFSET          0x001c /* Status Register */
#define LPC17_40_CAN_RFS_OFFSET         0x0020 /* Receive frame status */
#define LPC17_40_CAN_RID_OFFSET         0x0024 /* Received Identifier */
#define LPC17_40_CAN_RDA_OFFSET         0x0028 /* Received data bytes 1-4 */
#define LPC17_40_CAN_RDB_OFFSET         0x002c /* Received data bytes 5-8 */
#define LPC17_40_CAN_TFI1_OFFSET        0x0030 /* Transmit frame info (Tx Buffer 1) */
#define LPC17_40_CAN_TID1_OFFSET        0x0034 /* Transmit Identifier (Tx Buffer 1) */
#define LPC17_40_CAN_TDA1_OFFSET        0x0038 /* Transmit data bytes 1-4 (Tx Buffer 1) */
#define LPC17_40_CAN_TDB1_OFFSET        0x003c /* Transmit data bytes 5-8 (Tx Buffer 1) */
#define LPC17_40_CAN_TFI2_OFFSET        0x0040 /* Transmit frame info (Tx Buffer 2) */
#define LPC17_40_CAN_TID2_OFFSET        0x0044 /* Transmit Identifier (Tx Buffer 2) */
#define LPC17_40_CAN_TDA2_OFFSET        0x0048 /* Transmit data bytes 1-4 (Tx Buffer 2) */
#define LPC17_40_CAN_TDB2_OFFSET        0x004c /* Transmit data bytes 5-8 (Tx Buffer 2) */
#define LPC17_40_CAN_TFI3_OFFSET        0x0050 /* Transmit frame info (Tx Buffer 3) */
#define LPC17_40_CAN_TID3_OFFSET        0x0054 /* Transmit Identifier (Tx Buffer 3) */
#define LPC17_40_CAN_TDA3_OFFSET        0x0058 /* Transmit data bytes 1-4 (Tx Buffer 3) */
#define LPC17_40_CAN_TDB3_OFFSET        0x005c /* Transmit data bytes 5-8 (Tx Buffer 3) */

/* Register addresses ***************************************************************/
/* CAN acceptance filter registers */

#define LPC17_40_CANAF_AFMR             (LPC17_40_CANAF_BASE+LPC17_40_CANAF_AFMR_OFFSET)
#define LPC17_40_CANAF_SFFSA            (LPC17_40_CANAF_BASE+LPC17_40_CANAF_SFFSA_OFFSET)
#define LPC17_40_CANAF_SFFGRPSA         (LPC17_40_CANAF_BASE+LPC17_40_CANAF_SFFGRPSA_OFFSET)
#define LPC17_40_CANAF_EFFSA            (LPC17_40_CANAF_BASE+LPC17_40_CANAF_EFFSA_OFFSET)
#define LPC17_40_CANAF_EFFGRPSA         (LPC17_40_CANAF_BASE+LPC17_40_CANAF_EFFGRPSA_OFFSET)
#define LPC17_40_CANAF_EOT              (LPC17_40_CANAF_BASE+LPC17_40_CANAF_EOT_OFFSET)
#define LPC17_40_CANAF_LUTERRAD         (LPC17_40_CANAF_BASE+LPC17_40_CANAF_LUTERRAD_OFFSET)
#define LPC17_40_CANAF_LUTERR           (LPC17_40_CANAF_BASE+LPC17_40_CANAF_LUTERR_OFFSET)
#define LPC17_40_CANAF_FCANIE           (LPC17_40_CANAF_BASE+LPC17_40_CANAF_FCANIE_OFFSET)
#define LPC17_40_CANAF_FCANIC0          (LPC17_40_CANAF_BASE+LPC17_40_CANAF_FCANIC0_OFFSET)
#define LPC17_40_CANAF_FCANIC1          (LPC17_40_CANAF_BASE+LPC17_40_CANAF_FCANIC1_OFFSET)

/* Central CAN registers */

#define LPC17_40_CAN_TXSR               (LPC17_40_CAN_BASE+LPC17_40_CAN_TXSR_OFFSET)
#define LPC17_40_CAN_RXSR               (LPC17_40_CAN_BASE+LPC17_40_CAN_RXSR_OFFSET)
#define LPC17_40_CAN_MSR                (LPC17_40_CAN_BASE+LPC17_40_CAN_MSR_OFFSET)

/* CAN1/2 registers */

#define LPC17_40_CAN1_MOD               (LPC17_40_CAN1_BASE+LPC17_40_CAN_MOD_OFFSET)
#define LPC17_40_CAN1_CMR               (LPC17_40_CAN1_BASE+LPC17_40_CAN_CMR_OFFSET)
#define LPC17_40_CAN1_GSR               (LPC17_40_CAN1_BASE+LPC17_40_CAN_GSR_OFFSET)
#define LPC17_40_CAN1_ICR               (LPC17_40_CAN1_BASE+LPC17_40_CAN_ICR_OFFSET)
#define LPC17_40_CAN1_IER               (LPC17_40_CAN1_BASE+LPC17_40_CAN_IER_OFFSET)
#define LPC17_40_CAN1_BTR               (LPC17_40_CAN1_BASE+LPC17_40_CAN_BTR_OFFSET)
#define LPC17_40_CAN1_EWL               (LPC17_40_CAN1_BASE+LPC17_40_CAN_EWL_OFFSET)
#define LPC17_40_CAN1_SR                (LPC17_40_CAN1_BASE+LPC17_40_CAN_SR_OFFSET)
#define LPC17_40_CAN1_RFS               (LPC17_40_CAN1_BASE+LPC17_40_CAN_RFS_OFFSET)
#define LPC17_40_CAN1_RID               (LPC17_40_CAN1_BASE+LPC17_40_CAN_RID_OFFSET)
#define LPC17_40_CAN1_RDA               (LPC17_40_CAN1_BASE+LPC17_40_CAN_RDA_OFFSET)
#define LPC17_40_CAN1_RDB               (LPC17_40_CAN1_BASE+LPC17_40_CAN_RDB_OFFSET)
#define LPC17_40_CAN1_TFI1              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TFI1_OFFSET)
#define LPC17_40_CAN1_TID1              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TID1_OFFSET)
#define LPC17_40_CAN1_TDA1              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TDA1_OFFSET)
#define LPC17_40_CAN1_TDB1              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TDB1_OFFSET)
#define LPC17_40_CAN1_TFI2              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TFI2_OFFSET)
#define LPC17_40_CAN1_TID2              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TID2_OFFSET)
#define LPC17_40_CAN1_TDA2              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TDA2_OFFSET)
#define LPC17_40_CAN1_TDB2              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TDB2_OFFSET)
#define LPC17_40_CAN1_TFI3              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TFI3_OFFSET)
#define LPC17_40_CAN1_TID3              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TID3_OFFSET)
#define LPC17_40_CAN1_TDA3              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TDA3_OFFSET)
#define LPC17_40_CAN1_TDB3              (LPC17_40_CAN1_BASE+LPC17_40_CAN_TDB3_OFFSET)

