apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_can.h
#define LPC17_40_CAN2_MOD               (LPC17_40_CAN2_BASE+LPC17_40_CAN_MOD_OFFSET)
#define LPC17_40_CAN2_CMR               (LPC17_40_CAN2_BASE+LPC17_40_CAN_CMR_OFFSET)
#define LPC17_40_CAN2_GSR               (LPC17_40_CAN2_BASE+LPC17_40_CAN_GSR_OFFSET)
#define LPC17_40_CAN2_ICR               (LPC17_40_CAN2_BASE+LPC17_40_CAN_ICR_OFFSET)
#define LPC17_40_CAN2_IER               (LPC17_40_CAN2_BASE+LPC17_40_CAN_IER_OFFSET)
#define LPC17_40_CAN2_BTR               (LPC17_40_CAN2_BASE+LPC17_40_CAN_BTR_OFFSET)
#define LPC17_40_CAN2_EWL               (LPC17_40_CAN2_BASE+LPC17_40_CAN_EWL_OFFSET)
#define LPC17_40_CAN2_SR                (LPC17_40_CAN2_BASE+LPC17_40_CAN_SR_OFFSET)
#define LPC17_40_CAN2_RFS               (LPC17_40_CAN2_BASE+LPC17_40_CAN_RFS_OFFSET)
#define LPC17_40_CAN2_RID               (LPC17_40_CAN2_BASE+LPC17_40_CAN_RID_OFFSET)
#define LPC17_40_CAN2_RDA               (LPC17_40_CAN2_BASE+LPC17_40_CAN_RDA_OFFSET)
#define LPC17_40_CAN2_RDB               (LPC17_40_CAN2_BASE+LPC17_40_CAN_RDB_OFFSET)
#define LPC17_40_CAN2_TFI1              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TFI1_OFFSET)
#define LPC17_40_CAN2_TID1              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TID1_OFFSET)
#define LPC17_40_CAN2_TDA1              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TDA1_OFFSET)
#define LPC17_40_CAN2_TDB1              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TDB1_OFFSET)
#define LPC17_40_CAN2_TFI2              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TFI2_OFFSET)
#define LPC17_40_CAN2_TID2              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TID2_OFFSET)
#define LPC17_40_CAN2_TDA2              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TDA2_OFFSET)
#define LPC17_40_CAN2_TDB2              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TDB2_OFFSET)
#define LPC17_40_CAN2_TFI3              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TFI3_OFFSET)
#define LPC17_40_CAN2_TID3              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TID3_OFFSET)
#define LPC17_40_CAN2_TDA3              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TDA3_OFFSET)
#define LPC17_40_CAN2_TDB3              (LPC17_40_CAN2_BASE+LPC17_40_CAN_TDB3_OFFSET)

/* Register bit definitions *********************************************************/
/* CAN acceptance filter registers */
/* Acceptance Filter Register */

#define CANAF_AFMR_ACCOFF               (1 << 0)  /* Bit 0:  AF non-operational; All RX messages ignored */
#define CANAF_AFMR_ACCBP                (1 << 1)  /* Bit 1:  AF bypass: All RX messages accepted */
#define CANAF_AFMR_EFCAN                (1 << 2)  /* Bit 2:  Enable Full CAN mode */
                                                  /* Bits 3-31: Reserved */
/* Standard Frame Individual Start Address Register */
                                                  /* Bits 0-1: Reserved */
#define CANAF_SFFSA_SHIFT               (2)       /* Bits 2-10: Address of Standard Identifiers in AF Lookup RAM */
#define CANAF_SFFSA_MASK                (0x01ff << CANAF_SFFSA_SHIFT)
                                                  /* Bits 11-31: Reserved */
/* Standard Frame Group Start Address Register */
                                                  /* Bits 0-1: Reserved */
#define CANAF_SFFGRPSA_SHIFT            (2)       /* Bits 2-10: Address of grouped Standard Identifiers in AF Lookup RAM */
#define CANAF_SFFGRPSA_MASK             (0x01ff << CANAF_SFFGRPSA_SHIFT)
                                                  /* Bits 11-31: Reserved */
/* Extended Frame Start Address Register */
                                                  /* Bits 0-1: Reserved */
#define CANAF_EFFSA_SHIFT               (2)       /* Bits 2-10: Address of Extended Identifiers in AF Lookup RAM */
#define CANAF_EFFSA_MASK                (0x01ff << CANAF_EFFSA_SHIFT)
                                                  /* Bits 11-31: Reserved */
/* Extended Frame Group Start Address Register */
                                                  /* Bits 0-1: Reserved */
#define CANAF_EFFGRPSA_SHIFT            (2)       /* Bits 2-10: Address of grouped Extended Identifiers in AF Lookup RAM */
#define CANAF_EFFGRPSA_MASK             (0x01ff << CANAF_EFFGRPSA_SHIFT)
                                                  /* Bits 11-31: Reserved */
/* End of AF Tables register */
                                                  /* Bits 0-1: Reserved */
#define CANAF_EOT_SHIFT                 (2)       /* Bits 2-10: Last active address in last active AF table */
#define CANAF_EOT_MASK                  (0x01ff << CANAF_EOT_SHIFT)
                                                  /* Bits 11-31: Reserved */
/* LUT Error Address register */
                                                  /* Bits 0-1: Reserved */
#define CANAF_LUTERRAD_SHIFT            (2)       /* Bits 2-10: Address in AF Lookup RAM of error */
#define CANAF_LUTERRAD_MASK             (0x01ff << CANAF_EOT_SHIFT)
                                                  /* Bits 11-31: Reserved */
/* LUT Error Register */

#define CANAF_LUTERR_LUTERR             (1 << 0)  /* Bit 0: AF error in AF RAM tables */
                                                  /* Bits 1-31: Reserved */
/* FullCAN interrupt enable register */

#define CANAF_FCANIE_FCANIE             (1 << 0)  /* Bit 0: Global FullCAN Interrupt Enable */
                                                  /* Bits 1-31: Reserved */

/* FullCAN interrupt and capture register 0 */

#define CANAF_FCANIC0_INTPND(n)         (1 << (n)) /* n=0,1,2,... 31 */

/* FullCAN interrupt and capture register 1 */

#define CANAF_FCANIC1_INTPND(n)         (1 << ((n)-32)) /* n=32,33,...63 */

/* Central CAN registers */
/* CAN Central Transmit Status Register */

#define CAN_TXSR_TS1                    (1 << 0)  /* Bit 0:  CAN1 sending */
#define CAN_TXSR_TS2                    (1 << 1)  /* Bit 1:  CAN2 sending */
                                                  /* Bits 2-7: Reserved */
#define CAN_TXSR_TBS1                   (1 << 8)  /* Bit 8:  All 3 CAN1 TX buffers available */
#define CAN_TXSR_TBS2                   (1 << 9)  /* Bit 9:  All 3 CAN2 TX buffers available */
                                                  /* Bits 10-15: Reserved */
#define CAN_TXSR_TCS1                   (1 << 16) /* Bit 16:  All CAN1 xmissions completed */
#define CAN_TXSR_TCS2                   (1 << 17) /* Bit 17:  All CAN2 xmissions completed */
                                                  /* Bits 18-31: Reserved */
/* CAN Central Receive Status Register */

#define CAN_RXSR_RS1                    (1 << 0)  /* Bit 0:  CAN1 receiving */
#define CAN_RXSR_RS2                    (1 << 1)  /* Bit 1:  CAN2 receiving */
                                                  /* Bits 2-7: Reserved */
#define CAN_RXSR_RB1                    (1 << 8)  /* Bit 8:  CAN1 received message available */
#define CAN_RXSR_RB2                    (1 << 9)  /* Bit 9:  CAN2 received message available */
                                                  /* Bits 10-15: Reserved */
#define CAN_RXSR_DOS1                   (1 << 16) /* Bit 16:  All CAN1 message lost */
#define CAN_RXSR_DOS2                   (1 << 17) /* Bit 17:  All CAN2 message lost */
                                                  /* Bits 18-31: Reserved */
/* CAN Central Miscellaneous Register */

#define CAN_MSR_E1                      (1 << 0)  /* Bit 0:  CAN1 error counters at limit */
#define CAN_MSR_E2                      (1 << 1)  /* Bit 1:  CAN2 error counters at limit */
                                                  /* Bits 2-7: Reserved */
#define CAN_MSR_BS1                     (1 << 8)  /* Bit 8:  CAN1 busy */
#define CAN_MSR_BS2                     (1 << 9)  /* Bit 7:  CAN2 busy */
                                                  /* Bits 10-31: Reserved */
/* CAN1/2 registers */
/* CAN operating mode */

