apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_can.h
/* Interrupt Enable */

#define CAN_IER_RIE                     (1 << 0)  /* Bit 0:  Receiver Interrupt Enable */
#define CAN_IER_TIE1                    (1 << 1)  /* Bit 1:  Transmit Interrupt Enable for Buffer1 */
#define CAN_IER_EIE                     (1 << 2)  /* Bit 2:  Error Warning Interrupt Enable */
#define CAN_IER_DOIE                    (1 << 3)  /* Bit 3:  Data Overrun Interrupt Enable */
#define CAN_IER_WUIE                    (1 << 4)  /* Bit 4:  Wake-Up Interrupt Enable */
#define CAN_IER_EPIE                    (1 << 5)  /* Bit 5:  Error Passive Interrupt Enable */
#define CAN_IER_ALIE                    (1 << 6)  /* Bit 6:  Arbitration Lost Interrupt Enable */
#define CAN_IER_BEIE                    (1 << 7)  /* Bit 7:  Bus Error Interrupt */
#define CAN_IER_IDIE                    (1 << 8)  /* Bit 8:  ID Ready Interrupt Enable */
#define CAN_IER_TIE2                    (1 << 9)  /* Bit 9:  Transmit Interrupt Enable for Buffer2 */
#define CAN_IER_TIE3                    (1 << 10) /* Bit 10: Transmit Interrupt Enable for Buffer3 */
                                                  /* Bits 11-31: Reserved */
/* Bus Timing */

#define CAN_BTR_BRP_SHIFT               (0)       /* Bits 0-9: Baud Rate Prescaler */
#define CAN_BTR_BRP_MASK                (0x3ff << CAN_BTR_BRP_SHIFT)
                                                  /* Bits 10-13: Reserved */
#define CAN_BTR_SJW_SHIFT               (14)      /* Bits 14-15: Synchronization Jump Width */
#define CAN_BTR_SJW_MASK                (3 << CAN_BTR_SJW_SHIFT)
#define CAN_BTR_TSEG1_SHIFT             (16)      /* Bits 16-19: Sync to sample delay */
#define CAN_BTR_TSEG1_MASK              (15 << CAN_BTR_TSEG1_SHIFT)
#define CAN_BTR_TSEG2_SHIFT             (20)      /* Bits 20-22: sample to next delay */
#define CAN_BTR_TSEG2_MASK              (7 << CAN_BTR_TSEG2_SHIFT)
#define CAN_BTR_SAM                     (1 << 23) /* Bit 23: Sampling */
                                                  /* Bits 24-31: Reserved */

#define CAN_BTR_BRP_MAX                 (1024)    /* Maximum BTR value (without decrement) */
#define CAN_BTR_TSEG1_MAX               (16)      /* Maximum TSEG1 value (without decrement) */
#define CAN_BTR_TSEG2_MAX               (8)       /* Maximum TSEG2 value (without decrement) */

/* Error Warning Limit */

#define CAN_EWL_SHIFT                   (0)       /* Bits 0-7: Error warning limit */
#define CAN_EWL_MASK                    (0xff << CAN_EWL_SHIFT)
                                                  /* Bits 8-31: Reserved */
/* Status Register */

#define CAN_SR_RBS1                     (1 << 0)  /* Bit 0:  Receive Buffer Status */
#define CAN_SR_DOS1                     (1 << 1)  /* Bit 1:  Data Overrun Status */
#define CAN_SR_TBS1                     (1 << 2)  /* Bit 2:  Transmit Buffer Status 1 */
#define CAN_SR_TCS1                     (1 << 3)  /* Bit 3:  Transmission Complete Status */
#define CAN_SR_RS1                      (1 << 4)  /* Bit 4:  Receive Status */
#define CAN_SR_TS1                      (1 << 5)  /* Bit 5:  Transmit Status 1 */
#define CAN_SR_ES1                      (1 << 6)  /* Bit 6:  Error Status */
#define CAN_SR_BS1                      (1 << 7)  /* Bit 7:  Bus Status */
#define CAN_SR_RBS2                     (1 << 8)  /* Bit 8:  Receive Buffer Status */
#define CAN_SR_DOS2                     (1 << 9)  /* Bit 9:  Data Overrun Status */
#define CAN_SR_TBS2                     (1 << 10) /* Bit 10: Transmit Buffer Status 2 */
#define CAN_SR_TCS2                     (1 << 11) /* Bit 11: Transmission Complete Status */
#define CAN_SR_RS2                      (1 << 12) /* Bit 12: Receive Status */
#define CAN_SR_TS2                      (1 << 13) /* Bit 13: Transmit Status 2 */
#define CAN_SR_ES2                      (1 << 14) /* Bit 14: Error Status */
#define CAN_SR_BS2                      (1 << 15) /* Bit 15: Bus Status  */
#define CAN_SR_RBS3                     (1 << 16) /* Bit 16: Receive Buffer Status */
#define CAN_SR_DOS3                     (1 << 17) /* Bit 17: Data Overrun Status */
#define CAN_SR_TBS3                     (1 << 18) /* Bit 18: Transmit Buffer Status 3 */
#define CAN_SR_TCS3                     (1 << 19) /* Bit 19: Transmission Complete Status */
#define CAN_SR_RS3                      (1 << 20) /* Bit 20: Receive Status */
#define CAN_SR_TS3                      (1 << 21) /* Bit 21: Transmit Status 3 */
#define CAN_SR_ES3                      (1 << 22) /* Bit 22: Error Status */
#define CAN_SR_BS3                      (1 << 23) /* Bit 23: Bus Status */
                                                  /* Bits 24-31: Reserved */
/* Receive frame status */

#define CAN_RFS_ID_SHIFT                (0)       /* Bits 0-9: ID Index */
#define CAN_RFS_ID_MASK                 (0x03ff << CAN_RFS_ID_SHIFT)
#define CAN_RFS_BP                      (1 << 10) /* Bit 10: Received in AF Bypass mode */
                                                  /* Bits 11-15: Reserved */
#define CAN_RFS_DLC_SHIFT               (16)      /* Bits 16-19: Message Data Length Code (DLC) */
#define CAN_RFS_DLC_MASK                (15 << CAN_RFS_DLC_SHIFT)
                                                  /* Bits 20-29: Reserved */
#define CAN_RFS_RTR                     (1 << 30) /* Bit 30: Message Remote Transmission Request */
#define CAN_RFS_FF                      (1 << 31) /* Bit 31: Message 29-bit vs 11-bit ID */

/* Received Identifier */

#define CAN_RID_ID11_MASK               (0x7ff)   /* Bits 0-10: 11-bit Identifier (FF=0) */
                                                  /* Bits 11-31: Reserved */
#define CAN_RID_ID29_MASK               (0x1fffffff) /* Bits 0-28: 29-bit Identifiter (FF=1) */
                                                  /* Bits 29-31: Reserved */
/* Received data bytes 1-4 */

#define CAN_RDA_DATA1_SHIFT             (0)       /* Bits 0-7: If CANRFS >= 1 */
#define CAN_RDA_DATA1_MASK              (0x0ff << CAN_RDA_DATA1_SHIFT)
#define CAN_RDA_DATA2_SHIFT             (8)       /* Bits 8-15: If CANRFS >= 2 */
#define CAN_RDA_DATA2_MASK              (0x0ff << CAN_RDA_DATA2_SHIFT)
#define CAN_RDA_DATA3_SHIFT             (16)      /* Bits 16-23: If CANRFS >= 3 */
#define CAN_RDA_DATA3_MASK              (0x0ff << CAN_RDA_DATA3_SHIFT)
#define CAN_RDA_DATA4_SHIFT             (24)      /* Bits 24-31: If CANRFS >= 4 */
#define CAN_RDA_DATA4_MASK              (0x0ff << CAN_RDA_DATA4_SHIFT)

